Revit 2027 API
CameraInfo.NearDistance Property
 Distance from eye point to near plane of view frustum along the view direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NearDistance { get; }
Public ReadOnly Property NearDistance As Double
	Get
public:
property double NearDistance {
	double get ();
}
member NearDistance : float with get
Property Value
Double
Remarks
 This property together with FarDistance determines the depth restrictions of a view frustum.
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace